CynaCons/STM32-peripheral-exploration/src/main.c
/**
 ******************************************************************************
 * @file    main.c
 * @author  Constantin CHABIRAND
 * @version V0.1
 * @brief   Core file for the application
 *
 * DONE Make a macro for UART Sending.
 * DONE Modularize all peripheral components
 * DODONEE Clean all the ESP Code
 * DONE Implement the error checking for all function related to Init or ESP.
 * DONE Make an ErrorMemory module.
 * TODO Clarify the GPIO configuration for each component
 * TODO Beautify and comment the header files.
 * TODO Make the UartTx use TxComplete interrupt to prevent errors and overflow
 *
 *
 ******************************************************************************
 */
#include "stm32f4xx.h"
#include "stm32f4xx_it.h"
#include "stm32f4xx_hal_uart.h"
#include "components/dht22/dht22.h"
#include "components/util.h"
#include "components/Uart/UartRx.h"
#include "components/Uart/UartTx.h"
#include "components/Error/ErrorMemory.h"
#include "components/ESP8266/ESP8266.h"
#include "components/LightSensor/LightSensor.h"

#include <string.h>

void SystemClock_Config(void);
void HAL_MspInit(void);


extern DHT22_HandleTypeDef dht;
UART_HandleTypeDef huart2;
ADC_HandleTypeDef hadc1;


extern UartRx_TypeDef UartRx_Esp;


int main(void)
{
	uint32_t light_value;

	HAL_Init();
	SystemClock_Config();
	ErrorMemory_SetupLED();

	if (FALSE == DHT22_Setup())
		EM_ADD();

	if (FALSE == UartRx_Setup_Esp())
		EM_ADD();

	if (FALSE == ESP_Setup())
		EM_ADD();

	if (FALSE == LightSensor_Setup())
		EM_ADD();

	while (1){
		DHT22_ReadData(&dht);
		light_value = LightSensor_GetValue();
		ESP_SetRequestData("HTTP/1.1 200 OK\r\n\r\nTemperature: %.1f\nHumidity: %.1f\nLight: %.1lu",dht.temp, dht.hum, light_value);

		/* Check the buffer for a GET request */
		if ((HAL_GetTick() - UartRx_Esp.last_update) > 500) {
			if (TRUE == UartRx_Find(&UartRx_Esp, "GET")) {
				/* Clean UartRx first */
				UartRx_Reset(&UartRx_Esp);
				ESP_HandleRequest_GET();
			}
		}
	}

	for(;;);

}


/**
 * Initializes the Global MSP.
 */
void HAL_MspInit(void)
{
	HAL_NVIC_SetPriorityGrouping(NVIC_PRIORITYGROUP_0);

	/* System interrupt init*/
	/* MemoryManagement_IRQn interrupt configuration */
	HAL_NVIC_SetPriority(MemoryManagement_IRQn, 0, 0);
	/* BusFault_IRQn interrupt configuration */
	HAL_NVIC_SetPriority(BusFault_IRQn, 0, 0);
	/* UsageFault_IRQn interrupt configuration */
	HAL_NVIC_SetPriority(UsageFault_IRQn, 0, 0);
	/* SVCall_IRQn interrupt configuration */
	HAL_NVIC_SetPriority(SVCall_IRQn, 0, 0);
	/* DebugMonitor_IRQn interrupt configuration */
	HAL_NVIC_SetPriority(DebugMonitor_IRQn, 0, 0);
	/* PendSV_IRQn interrupt configuration */
	HAL_NVIC_SetPriority(PendSV_IRQn, 0, 0);
	/* SysTick_IRQn interrupt configuration */
	HAL_NVIC_SetPriority(SysTick_IRQn, 0, 0);
}


/**
 * System Clock Configuration
 */
void SystemClock_Config(void)
{

	RCC_OscInitTypeDef RCC_OscInitStruct;
	RCC_ClkInitTypeDef RCC_ClkInitStruct;

	/**Configure the main internal regulator output voltage
	 */
	__HAL_RCC_PWR_CLK_ENABLE();

	__HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);

	/**Initializes the CPU, AHB and APB busses clocks
	 */
	RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI;
	RCC_OscInitStruct.HSIState = RCC_HSI_ON;
	RCC_OscInitStruct.HSICalibrationValue = 16;
	RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
	RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSI;
	RCC_OscInitStruct.PLL.PLLM = 8;
	RCC_OscInitStruct.PLL.PLLN = 168;
	RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV2;
	RCC_OscInitStruct.PLL.PLLQ = 7;
	if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
	{
	}

	/**Initializes the CPU, AHB and APB busses clocks
	 */
	RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
			|RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
	RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
	RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
	RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV4;
	RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV2;

	if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_5) != HAL_OK)
	{
	}

	/**Configure the Systick interrupt time
	 */
	HAL_SYSTICK_Config(HAL_RCC_GetHCLKFreq()/1000);

	/**Configure the Systick
	 */
	HAL_SYSTICK_CLKSourceConfig(SYSTICK_CLKSOURCE_HCLK);

	/* SysTick_IRQn interrupt configuration */
	HAL_NVIC_SetPriority(SysTick_IRQn, 0, 0);
}
